import clsx from "clsx";
import { twMerge } from "tailwind-merge";
//📌 tailwind-merge Объединяет классы и удаляет распознанные конфликты.
// Если компонент принимает внешний className, который должен переопределять внутренние Tailwind-классы, полезно совместить обе библиотеки.

// Если используются нестандартные утилиты или конфигурация Tailwind, нужно проверять, корректно ли tailwind-merge распознаёт соответствующие конфликты.

const className = twMerge(
  clsx("rounded-lg px-4 py-2", "bg-blue-600 text-white", "px-8 bg-green-600"),
);
console.log(className);
// 📌
// Сначала выполняется clsx():
// rounded-lg px-4 py-2 bg-blue-600 text-white px-8 bg-green-600

// Затем twMerge() удаляет конфликты, остаются:
// rounded-lg py-2 text-white px-8 bg-green-600

// В результате:
// - px-4 заменяется на px-8;
// - bg-blue-600 заменяется на bg-green-600;
// - rounded-lg, py-2 и text-white сохраняются.

// Именно такая комбинация помогает создавать компоненты, у которых есть базовые стили, условные состояния и возможность передать дополнительные классы.

// export default function MergeButton();

// 📌Что tailwind-merge не делает

// - Она не всегда понимает конфликты между произвольными CSS-свойствами и обычными Tailwind-классами.
// Например, произвольное CSS-свойство:
// cn("p-4", "[padding:1rem]");

// tailwind-merge не обязана распознать здесь конфликт между произвольным свойством и p-4, поэтому оба класса могут остаться. Для обычных Tailwind-классов лучше использовать стандартные утилиты, если они подходят.
